## Springboard Data Science Capstone Two 
## 2. Data Wrangling

In this part of the capstone, we'll import, review, clean and prepare the data for the explanatory data analysis in the next phase. Due to the large sizes of the data, they'll not be pushed to the github. They can be accessed at https://www.kaggle.com/datasets/usdot/flight-delays?select=flights.csv.


### 2.1 Import & Review the Data

First, let's import the data and take a close look at them.

In [1]:
# Import pandasa, os, and matplotlib.pyplot modules.

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
# Import data.

df_flight = pd.read_csv('flights.csv')
df_airport = pd.read_csv('airports.csv')
df_airline = pd.read_csv('airlines.csv')

C:\Users\wfgyi\AppData\Local\Temp\ipykernel_2860\3906611510.py:3: DtypeWarning: Columns (7,8) have mixed types. Specify dtype option on import or set low_memory=False.
  df_flight = pd.read_csv('flights.csv')

In [3]:
df_flight.head(5)

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,...,ARRIVAL_TIME,ARRIVAL_DELAY,DIVERTED,CANCELLED,CANCELLATION_REASON,AIR_SYSTEM_DELAY,SECURITY_DELAY,AIRLINE_DELAY,LATE_AIRCRAFT_DELAY,WEATHER_DELAY
0,2015,1,1,4,AS,98,N407AS,ANC,SEA,5,...,408.0,-22.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
1,2015,1,1,4,AA,2336,N3KUAA,LAX,PBI,10,...,741.0,-9.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
2,2015,1,1,4,US,840,N171US,SFO,CLT,20,...,811.0,5.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
3,2015,1,1,4,AA,258,N3HYAA,LAX,MIA,20,...,756.0,-9.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,2015,1,1,4,AS,135,N527AS,SEA,ANC,25,...,259.0,-21.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df_flight.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5819079 entries, 0 to 5819078
Data columns (total 31 columns):
 #   Column               Dtype
---  ------               -----
 0   YEAR                 int64
 1   MONTH                int64
 2   DAY                  int64
 3   DAY_OF_WEEK          int64
 4   AIRLINE              object
 5   FLIGHT_NUMBER        int64
 6   TAIL_NUMBER          object
 7   ORIGIN_AIRPORT       object
 8   DESTINATION_AIRPORT  object
 9   SCHEDULED_DEPARTURE  int64
 10  DEPARTURE_TIME       float64
 11  DEPARTURE_DELAY      float64
 12  TAXI_OUT             float64
 13  WHEELS_OFF           float64
 14  SCHEDULED_TIME       float64
 15  ELAPSED_TIME         float64
 16  AIR_TIME             float64
 17  DISTANCE             int64
 18  WHEELS_ON            float64
 19  TAXI_IN              float64
 20  SCHEDULED_ARRIVAL    int64
 21  ARRIVAL_TIME         float64
 22  ARRIVAL_DELAY        float64
 23  DIVERTED             int64
 24  CANCELLED            int64
 25  CANCELLATION_REASON  object
 26  AIR_SYSTEM_DELAY     float64
 27  SECURITY_DELAY       float64
 28  AIRLINE_DELAY        float64
 29  LATE_AIRCRAFT_DELAY  float64
 30  WEATHER_DELAY        float64
dtypes: float64(16), int64(10), object(5)
memory usage: 1.3+ GB

In [5]:
df_airport.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 322 entries, 0 to 321
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   IATA_CODE  322 non-null    object
 1   AIRPORT    322 non-null    object
 2   CITY       322 non-null    object
 3   STATE      322 non-null    object
 4   COUNTRY    322 non-null    object
 5   LATITUDE   319 non-null    float64
 6   LONGITUDE  319 non-null    float64
dtypes: float64(2), object(5)
memory usage: 17.7+ KB

In [6]:
df_airline.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   IATA_CODE  14 non-null     object
 1   AIRLINE    14 non-null     object
dtypes: object(2)
memory usage: 352.0+ bytes

### 2.2 Explore, Clean & Prepare the Data

Now, let's take a look at the flight entries with null value.

In [7]:
df_flight.isnull().sum()

YEAR                         0
MONTH                        0
DAY                          0
DAY_OF_WEEK                  0
AIRLINE                      0
FLIGHT_NUMBER                0
TAIL_NUMBER              14721
ORIGIN_AIRPORT               0
DESTINATION_AIRPORT          0
SCHEDULED_DEPARTURE          0
DEPARTURE_TIME           86153
DEPARTURE_DELAY          86153
TAXI_OUT                 89047
WHEELS_OFF               89047
SCHEDULED_TIME               6
ELAPSED_TIME            105071
AIR_TIME                105071
DISTANCE                     0
WHEELS_ON                92513
TAXI_IN                  92513
SCHEDULED_ARRIVAL            0
ARRIVAL_TIME             92513
ARRIVAL_DELAY           105071
DIVERTED                     0
CANCELLED                    0
CANCELLATION_REASON    5729195
AIR_SYSTEM_DELAY       4755640
SECURITY_DELAY         4755640
AIRLINE_DELAY          4755640
LATE_AIRCRAFT_DELAY    4755640
WEATHER_DELAY          4755640
dtype: int64

The delay reason columns, 'AIR_SYSTEM_DELAY', 'SECURITY_DELAY', 'AIRLINE_DELAY', 'LATE_AIRCRAFT_DELAY' and 'WEATHER_DELAY', contain a significant amount of null values. If we are interested to investigate the reasons for flight delays, then these columns will be of great use to us. However, our goal here is to find which element or combination of elements are likely to cause flight cancellation. Therefore, these columns are not relevant and can be dropped. The other columns with null values, "TAIL_NUMBER", "DEPARTURE_TIME", "DEPARTURE_DELAY", "TAXI_OUT", "WHEELS_OFF", "ELAPSED_TIME", "AIR_TIME", "WHEELS_ON", "TAXI_IN", "ARRIVAL_TIME", "ARRIVAL_DELAY" and "DIVERTED", are not relevant to our study here, and therefore can be dropped as well.

In [8]:
col = ['TAIL_NUMBER', 'DEPARTURE_TIME', 'DEPARTURE_DELAY', 'TAXI_OUT', 'WHEELS_OFF', 'ELAPSED_TIME', 'AIR_TIME', 'WHEELS_ON', 'TAXI_IN', 'ARRIVAL_TIME', 'ARRIVAL_DELAY', 'DIVERTED', 'AIR_SYSTEM_DELAY', 'SECURITY_DELAY', 'AIRLINE_DELAY', 'LATE_AIRCRAFT_DELAY', 'WEATHER_DELAY']
df_flight = df_flight[df_flight.columns[~df_flight.columns.isin(col)]]

In [9]:
# Verify if all data entry 'YEAR' is 2015.  If so, delete 'YEAR' column.  
df_flight['YEAR'].unique()
df_flight.drop('YEAR', axis=1, inplace=True)

In [10]:
# Let's take a look aqt the cancellation reason column and see if we need to keep it.
print(df_flight.CANCELLATION_REASON.unique())

# Drop the cancellation_reason column.
df_flight.drop('CANCELLATION_REASON', axis=1, inplace=True)
df_flight

[nan 'A' 'B' 'C' 'D']

,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,SCHEDULED_TIME,DISTANCE,SCHEDULED_ARRIVAL,CANCELLED
0,1,1,4,AS,98,ANC,SEA,5,205.0,1448,430,0
1,1,1,4,AA,2336,LAX,PBI,10,280.0,2330,750,0
2,1,1,4,US,840,SFO,CLT,20,286.0,2296,806,0
3,1,1,4,AA,258,LAX,MIA,20,285.0,2342,805,0
4,1,1,4,AS,135,SEA,ANC,25,235.0,1448,320,0
...,...,...,...,...,...,...,...,...,...,...,...,...
5819074,12,31,4,B6,688,LAX,BOS,2359,320.0,2611,819,0
5819075,12,31,4,B6,745,JFK,PSE,2359,227.0,1617,446,0
5819076,12,31,4,B6,1503,JFK,SJU,2359,221.0,1598,440,0
5819077,12,31,4,B6,333,MCO,SJU,2359,161.0,1189,340,0
5819078,12,31,4,B6,839,JFK,BQN,2359,221.0,1576,440,0

Since our investigation is mainly on flight cancellation for outbound flights out of Los Angeles International Airport, let's get all the flights departing from LAX.

In [11]:
# First, let's take a look at all the unique values of "ORIGIN_AIRPORT" before 
# extracting our LAX outbound flights.
Origin_Airports = df_flight.ORIGIN_AIRPORT.unique()
Origin_Airports

array(['ANC', 'LAX', 'SFO', 'SEA', 'LAS', 'DEN', 'SLC', 'PDX', 'FAI',
       'MSP', 'PHX', 'SJU', 'PBG', 'IAG', 'PSE', 'BQN', 'ORD', 'GEG',
       'HNL', 'ONT', 'MCO', 'BOS', 'HIB', 'ABR', 'MAF', 'DFW', 'MKE',
       'IAH', 'BNA', 'BRO', 'VPS', 'BOI', 'BJI', 'SGF', 'PHL', 'SBN',
       'RDD', 'EUG', 'IAD', 'BUF', 'PWM', 'JFK', 'CRP', 'PIA', 'FAT',
       'SMF', 'AUS', 'MCI', 'ATL', 'JAX', 'MFR', 'IDA', 'MSN', 'DCA',
       'SAT', 'CHS', 'SBA', 'SMX', 'IND', 'CLE', 'GSP', 'BDL', 'ABI',
       'RIC', 'BFL', 'OMA', 'RDM', 'FLL', 'CID', 'TPA', 'SYR', 'ROC',
       'TYR', 'LAN', 'XNA', 'GSO', 'EWR', 'PBI', 'RSW', 'OAK', 'PVD',
       'RNO', 'PIT', 'ABQ', 'MIA', 'BWI', 'LGA', 'TUL', 'LIT', 'MSY',
       'OKC', 'ATW', 'PNS', 'MEM', 'TYS', 'MHT', 'SAV', 'CLT', 'GRB',
       'ABE', 'JAN', 'OAJ', 'FAR', 'ERI', 'LEX', 'CWA', 'MSO', 'TTN',
       'AMA', 'CLL', 'HOU', 'JLN', 'MLI', 'RDU', 'CVG', 'MHK', 'MOB',
       'TLH', 'BHM', 'CAE', 'TXK', 'ACY', 'DTW', 'RAP', 'TUS', 'EAU',
       'DLH', 'FSD', 'INL', 'CMX', 'SPI', 'CLD', 'COD', 'CMH', 'LRD',
       'PSC', 'CPR', 'ACV', 'DAL', 'PAH', 'MRY', 'ESC', 'ISN', 'PSP',
       'MFE', 'STL', 'BTV', 'FSM', 'AEX', 'SPS', 'ACT', 'SJT', 'MTJ',
       'GCC', 'OGG', 'SJC', 'GUC', 'ORF', 'MOT', 'MLU', 'KOA', 'SAN',
       'LAW', 'PIB', 'MGM', 'SBP', 'COS', 'LAR', 'DRO', 'BIS', 'ITO',
       'BTR', 'GRI', 'HLN', 'BZN', 'MDW', 'MDT', 'SCE', 'LIH', 'TWF',
       'BPT', 'GPT', 'STC', 'HPN', 'MLB', 'PLN', 'CIU', 'CAK', 'DSM',
       'BLI', 'SHV', 'ROW', 'FWA', 'SNA', 'ALB', 'HOB', 'LNK', 'CMI',
       'COU', 'GTF', 'EKO', 'LGB', 'AVL', 'HSV', 'SAF', 'GRR', 'SUX',
       'LFT', 'HYS', 'ELP', 'DVL', 'ISP', 'BUR', 'DAB', 'DAY', 'GRK',
       'GJT', 'BMI', 'LBE', 'ASE', 'RKS', 'GUM', 'TVC', 'ALO', 'IMT',
       'LCH', 'JNU', 'JAC', 'MEI', 'DBQ', 'GCK', 'GNV', 'BRD', 'DIK',
       'SDF', 'LBB', 'AVP', 'BTM', 'ELM', 'PIH', 'ICT', 'SUN', 'LWS',
       'VEL', 'STT', 'YUM', 'FLG', 'FCA', 'HDN', 'JMS', 'ROA', 'CHA',
       'EYW', 'MYR', 'CRW', 'MQT', 'CHO', 'ECP', 'EVV', 'EGE', 'MBS',
       'GFK', 'TOL', 'BIL', 'OTZ', 'KTN', 'STX', 'ILM', 'PUB', 'RHI',
       'CDC', 'HRL', 'SCC', 'FNT', 'LSE', 'MMH', 'APN', 'AGS', 'CEC',
       'DHN', 'WRG', 'PHF', 'CNY', 'BRW', 'GGG', 'AZO', 'SRQ', 'ORH',
       'TRI', 'VLD', 'SIT', 'BQK', 'PSG', 'FAY', 'MKG', 'CSG', 'EWN',
       'OME', 'SGU', 'RST', 'GTR', 'BET', 'ABY', 'SWF', 'ILG', 'ADK',
       'UST', 'YAK', 'CDV', 'OTH', 'ADQ', 'PPG', 'BGM', 'BGR', 'ITH',
       'ACK', 'MVY', 'WYS', 'DLG', 'AKN', 'GST', 'HYA', '14747', '14771',
       '12889', '12892', '14869', '10299', '11292', '14107', '11630',
       '10732', '14254', '10141', '10627', '11982', '12173', '13930',
       '14683', '12266', '11618', '10721', '13487', '11884', '15919',
       '13851', '11111', '10693', '12191', '14783', '15016', '14487',
       '10423', '15370', '11953', '13891', '15376', '11778', '11278',
       '14100', '13204', '15304', '11637', '14842', '10155', '11775',
       '11298', '11057', '13931', '10821', '14122', '11049', '10990',
       '10631', '13158', '14108', '13198', '11447', '12206', '13495',
       '14057', '15624', '10747', '15411', '12891', '10994', '13256',
       '10792', '14492', '12451', '13127', '10781', '14960', '12278',
       '14685', '11995', '13485', '11977', '10257', '13796', '13232',
       '13296', '14570', '14893', '14524', '12217', '10713', '10208',
       '10136', '11603', '14689', '11471', '11315', '13264', '12478',
       '14814', '11308', '11066', '12896', '10397', '14307', '11721',
       '11140', '10185', '13277', '11203', '13342', '11433', '11697',
       '12953', '10599', '12156', '14952', '10620', '11042', '15096',
       '10408', '15249', '11423', '12915', '12264', '12339', '10140',
       '13871', '14027', '13244', '11267', '11540', '14576', '10868',
       '13486', '13476', '14489', '12945', '15607', '10529', '11986',
       '14635', '13303', '10785', '15380', '11996', '10561', '10874',
       '13367', '10146', '10431', '11973', '10980', '12197', '14098',
       '12323', '10577', '11150', '10135', '11617', '13795', '13029',
       '11003', '11146', '11577', '15356', '11259', '10279', '14321',
       '14843', '11638', '14828', '11481', '12951', '10434', '12448',
       '14730', '15323', '14252', '11193', '10849', '14193', '14986',
       '11641', '12992', '13422', '11612', '11823', '11980', '13290',
       '10158', '10685', '13377', '11109', '11076', '11122', '11865',
       '14543', '14905', '11587', '14457', '12335', '12343', '12003',
       '10157', '12884', '14633', '15048', '10268', '15295', '12389',
       '11525', '14262', '12888', '12391', '11648', '14696', '12758',
       '13830', '10469', '15412', '10731', '14679', '14831', '11413',
       '13433', '12982', '11867', '14698', '11537', '15389', '12402',
       '11337', '13360', '13076', '14006', '10728', '15401', '13230',
       '12016', '11067', '11274', '11921', '12519', '11013', '10779',
       '14150', '14794', '12511', '12177', '12523', '14908', '12007',
       '14588', '13577', '13061', '15041', '14109', '10800', '12954',
       '12441', '12898', '11695', '16218', '14113', '11624', '11503',
       '10739', '14574', '14711', '12129', '15070', '14520', '13184',
       '11252', '12280', '13241', '11898', '15024', '14674', '10551',
       '12819', '13459', '10581', '13970', '10372', '10918', '14709',
       '12255', 11267, 12266, 10821, 14771, 11433, 11982, 11905, 15411,
       14679, 14108, 10397, 13871, 11618, 14574, 10423, 11259, 10800,
       11140, 12191, 12889, 13198, 10529, 10693, 13232, 11540, 14570,
       14635, 14831, 11298, 13204, 11278, 14100, 12892, 12478, 13930,
       15304, 14107, 12523, 12954, 11697, 14057, 12339, 13487, 14893,
       11986, 11292, 14576, 15370, 12402, 14908, 12953, 12758, 15016,
       10721, 12264, 10685, 11612, 13277, 11057, 12891, 12197, 11193,
       13495, 13891, 13244, 14843, 14747, 11996, 10333, 14262, 11695,
       13342, 14698, 10431, 15376, 12451, 14524, 13830, 13796, 14122,
       14960, 16218, 10713, 11066, 10208, 14683, 14869, 14492, 11638,
       11413, 10792, 10408, 14689, 10980, 14952, 12951, 15323, 11884,
       14307, 14730, 14783, 11603, 11977, 11921, 13577, 13061, 13851,
       11042, 12448, 12992, 10874, 12896, 11308, 12173, 12206, 13377,
       10747, 13256, 13303, 10185, 10599, 10140, 15295, 11898, 13795,
       10728, 10994, 12391, 10299, 12217, 13290, 12007, 11109, 15096,
       10627, 13433, 15249, 12278, 12915, 11637, 13931, 13485, 11721,
       11775, 13476, 15841, 14027, 15380, 12945, 11315, 15919, 13360,
       10868, 14986, 12982, 10279, 11150, 13264, 14193, 11823, 13367,
       10469, 11423, 11337, 11252, 13029, 14696, 11049, 13296, 14685,
       13158, 12323, 10257, 14588, 11274, 13344, 13933, 15412, 13422,
       11146, 15991, 13230, 14794, 11003, 14828, 10781, 10990, 10785,
       10434, 14457, 11481, 11537, 10136, 14814, 10754, 10135, 10731,
       13127, 14321, 10849, 14098, 10146, 15607, 11624, 12177, 10158,
       12884, 15624, 14256, 11973, 14842, 15356, 10561, 14113, 15389,
       14489, 12094, 12888, 13076, 12129, 13873, 10157, 11995, 10631,
       12441, 12343, 14252, 11097, 10732, 10154, 11122, 11641, 13486,
       12003, 10620, 10779, 12335, 11076, 15041, 12156, 12280, 10926,
       12819, 11865, 12519, 11778, 10551, 12389, 11953, 12898, 15024,
       10155, 11013, 10372, 11587, 13964, 11980, 11630, 11648, 14905,
       11525, 15070, 11471, 11111, 14633, 11447, 11203, 13241, 12511,
       11067, 10268, 13184, 10141, 13541, 14150, 15027, 14109, 15048,
       14006, 10739, 14520, 11617, 14487, 11867, 14674, 14543, 10577,
       10170, 11577, 14709, 14711, 12255, 10165, 10918, 15401, 13970,
       15497, 12265, 14254, 10581, 12016, 11503, 13459, 14222, 14025,
       13502, '15841', '13344', '15991', '10754', '14256', '13873',
       '11097', '10926', '13964', '11905', '15027', '13933', '10170',
       '10333', '14222', '14025', '13502', '15497', '12265'], dtype=object)

We have both good news and bad news from observing the above data.  The good news is that we've found the 'LAX' code in the unique airport list for Los Angeles Int'l Airport.  The bad news is that in addition to the 3-letter airport code, there are also a lot of 5-digit numbers and strings in the origin airport column.  

One possibility is that these 5-digit entries represent the zip code for the airport location. However, after research, this does not seem to be true, as the zip code for LAX is 90045, much bigger than any of the 5-digit numbers listed in the data.  

Another research reveraled this Kaggle post https://www.kaggle.com/datasets/smiller933/bts?select=L_AIRPORT_ID.csv, which led us to the cross-reference between each 5-digit code and its corresponding airport.  Now, let's import the 2 airport code reference files, extract all flight entries out of LAX and replace all the 5-digit destination airport codes with the 3-letter IATA codes.

In [12]:
airport_id5 = pd.read_csv("L_AIRPORT_ID.csv")
airport_id5.info()
airport_id5.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6414 entries, 0 to 6413
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Code         6414 non-null   int64
 1   Description  6414 non-null   object
dtypes: int64(1), object(1)
memory usage: 100.3+ KB

    Code                                    Description
0  10001         Afognak Lake, AK: Afognak Lake Airport
1  10003  Granite Mountain, AK: Bear Creek Mining Strip
2  10004                       Lik, AK: Lik Mining Camp

In [13]:
airport_id3 = pd.read_csv("L_AIRPORT.csv")
airport_id3.info()
airport_id3.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6429 entries, 0 to 6428
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Code         6429 non-null   object
 1   Description  6429 non-null   object
dtypes: object(2)
memory usage: 100.6+ KB

  Code                                    Description
0  01A         Afognak Lake, AK: Afognak Lake Airport
1  03A  Granite Mountain, AK: Bear Creek Mining Strip
2  04A                       Lik, AK: Lik Mining Camp

In [14]:
airport_ref = pd.merge(airport_id5, airport_id3, how='left', on='Description')
airport_ref

      Code_x                                        Description Code_y
0      10001             Afognak Lake, AK: Afognak Lake Airport    01A
1      10003      Granite Mountain, AK: Bear Creek Mining Strip    03A
2      10004                           Lik, AK: Lik Mining Camp    04A
3      10005             Little Squaw, AK: Little Squaw Airport    05A
4      10006                         Kizhuyak, AK: Kizhuyak Bay    06A
...      ...                                                ...    ...
6469   16748                 Doylestown, PA: Doylestown Airport    DYL
6470   16749                   China Spring, TX: Wildcat Canyon    T7X
6471   16750  Sanford, NC: Raleigh Exec Jetport at Sanford L...    N4C
6472   16751                           Placida, FL: Coral Creek    FL7
6473   99999                            Unknown Point in Alaska    ZZZ

[6474 rows x 3 columns]

In [15]:
LAX_code = airport_ref[airport_ref['Description'].str.contains('Los Angeles')]
LAX_code

      Code_x                                        Description Code_y
584    10598  Bahia de Los Angeles, Mexico: Bahia de Los Ang...    BHL
2795   12892         Los Angeles, CA: Los Angeles International    LAX
2985   13082                  Los Angeles, Chile: Maria Dolores    LSQ
6398   16678                          Los Angeles, CA: Whiteman    WHP

Based upon the above list, we can conclude that both LAX and 12892 refer to the Los Angeles Int'l Airport. Now let's extra all flights departing from LAX.

In [16]:
df_LAX = df_flight[(df_flight.ORIGIN_AIRPORT=='LAX') | (df_flight.ORIGIN_AIRPORT==12892)]
df_LAX.shape

(211388, 12)

Next let's take a look at the unique numbers of all the destination airports and replace those 5-digit numbers with 3-letter IATA codes.

In [17]:
destination_airport = df_LAX['DESTINATION_AIRPORT'].unique()
destination_airport

array(['PBI', 'MIA', 'CLT', 'MSP', 'IAH', 'DEN', 'DFW', 'ORD', 'SEA',
       'ATL', 'EWR', 'SFO', 'STL', 'JFK', 'LAS', 'PHL', 'AUS', 'PHX',
       'PDX', 'BOS', 'DTW', 'SLC', 'HNL', 'BNA', 'CLD', 'IAD', 'SMF',
       'DAL', 'SAN', 'MCO', 'SAT', 'TUS', 'JAC', 'ASE', 'RDU', 'BZN',
       'DCA', 'OGG', 'BOI', 'EGE', 'ELP', 'BWI', 'KOA', 'MCI', 'MRY',
       'RNO', 'COS', 'LIH', 'ABQ', 'MDW', 'FAT', 'HOU', 'PSP', 'SJC',
       'SBA', 'FLL', 'SAF', 'MKE', 'CMH', 'OAK', 'SBP', 'IND', 'PIT',
       'EUG', 'TPA', 'CVG', 'MSY', 'SMX', 'HDN', 'ICT', 'CLE', 'ITO',
       'RDM', 'MEM', 'OKC', 'GEG', 'ANC', 'MTJ', 'OMA', 'MSN', 14492,
       15304, 14107, 12173, 13796, 12478, 13930, 12889, 14679, 15016,
       10397, 12264, 13303, 14100, 12266, 14747, 11298, 14057, 14771,
       13830, 14831, 11292, 13487, 14683, 12339, 11057, 10693, 12191,
       14122, 10721, 13342, 14893, 11433, 14689, 14570, 14869, 10423,
       11618, 11259, 11540, 11193, 15376, 13198, 10821, 13495, 11278,
       14698, 13232, 13851, 13204, 11603, 10140, 11697, 13476, 10713,
       13244, 12982, 12402, 12758, 11638, 11109, 11042, 11066, 14262,
       10299, 10372, 14908], dtype=object)

In [18]:
# Extract destination airport codes that are 5-digit integers.
destination_airport5 = pd.DataFrame()
destination_airport5["Code"] = [x for x in destination_airport if type(x)==int]

In [19]:
# Use merge to find out the corresponding 3-letter IATA code for each 5-digit airport code.
destination_airport_ref = destination_airport5.merge(airport_ref, how="left", left_on="Code", right_on="Code_x")
destination_airport_ref

     Code  Code_x                                        Description Code_y
0   14492   14492   Raleigh/Durham, NC: Raleigh-Durham International    RDU
1   15304   15304                     Tampa, FL: Tampa International    TPA
2   14107   14107      Phoenix, AZ: Phoenix Sky Harbor International    PHX
3   12173   12173               Honolulu, HI: Honolulu International    HNL
4   13796   13796    Oakland, CA: Metropolitan Oakland International    OAK
..    ...     ...                                                ...    ...
63  11066   11066          Columbus, OH: Port Columbus International    CMH
64  14262   14262       Palm Springs, CA: Palm Springs International    PSP
65  10299   10299  Anchorage, AK: Ted Stevens Anchorage Internati...    ANC
66  10372   10372         Aspen, CO: Aspen Pitkin County Sardy Field    ASE
67  14908   14908    Santa Ana, CA: John Wayne Airport-Orange County    SNA

[68 rows x 4 columns]

In [20]:
len(destination_airport_ref.Code.unique())

67

In [21]:
# Check out duplicate entries in the destination_airport_ref file.
print(destination_airport_ref[destination_airport_ref.duplicated(['Code'])])

     Code  Code_x                                   Description Code_y
37  10423   10423  Austin, TX: Austin - Bergstrom International    BSM

In [22]:
destination_airport_ref[destination_airport_ref.Code==10423]

     Code  Code_x                                   Description Code_y
36  10423   10423  Austin, TX: Austin - Bergstrom International    AUS
37  10423   10423  Austin, TX: Austin - Bergstrom International    BSM

In [23]:
# Keep the correct IATA code "AUS" and delete the duplicate row.
destination_airport_ref = destination_airport_ref[destination_airport_ref.Code_y != 'BSM']
destination_airport_ref.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 67 entries, 0 to 67
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Code         67 non-null     int64
 1   Code_x       67 non-null     int64
 2   Description  67 non-null     object
 3   Code_y       67 non-null     object
dtypes: int64(2), object(2)
memory usage: 2.6+ KB

In [24]:
destination_airport_ref = destination_airport_ref[['Code', 'Code_y']]
destination_airport_ref = destination_airport_ref.rename(columns={'Code':'DESTINATION_AIRPORT'})
destination_airport_ref

    DESTINATION_AIRPORT Code_y
0                 14492    RDU
1                 15304    TPA
2                 14107    PHX
3                 12173    HNL
4                 13796    OAK
..                  ...    ...
63                11066    CMH
64                14262    PSP
65                10299    ANC
66                10372    ASE
67                14908    SNA

[67 rows x 2 columns]

Now let's replace all the 5-digit destination aiport codes in the df_LAX_origin file with their corresponding 3-letter IATA codes.

In [25]:
destination_airport_ref.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 67 entries, 0 to 67
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   DESTINATION_AIRPORT  67 non-null     int64
 1   Code_y               67 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.6+ KB

In [26]:
# Merge the df_LAX file and the desination_airport_ref file.

df_LAX = df_LAX.merge(destination_airport_ref, how='left', on='DESTINATION_AIRPORT')

In [27]:
df_LAX.shape

(211388, 13)

In [28]:
df_LAX1 = df_LAX[df_LAX['Code_y'].isnull()]
print(df_LAX1.shape)
df_LAX2 = df_LAX[~df_LAX['Code_y'].isnull()]
print(df_LAX2.shape)

(194673, 13)
(16715, 13)

In [29]:
df_LAX2

,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,SCHEDULED_TIME,DISTANCE,SCHEDULED_ARRIVAL,CANCELLED,Code_y
161169,10,1,4,AA,699,12892,14492,1020,298.0,2239,1818,0,RDU
161170,10,1,4,DL,725,12892,15304,1020,268.0,2158,1748,0,TPA
161171,10,1,4,OO,4794,12892,14107,1020,91.0,370,1151,0,PHX
161172,10,1,4,DL,2218,12892,12173,1025,340.0,2556,1305,0,HNL
161173,10,1,4,OO,4765,12892,13796,1025,88.0,337,1153,0,OAK
...,...,...,...,...,...,...,...,...,...,...,...,...,...
177879,10,30,5,WN,1508,12892,12889,1040,65.0,236,1145,0,LAS
177880,10,30,5,DL,1754,12892,10397,1045,255.0,1947,1800,0,ATL
177881,10,30,5,AA,1297,12892,13303,1045,301.0,2342,1846,0,MIA
177882,10,30,5,AA,796,12892,14100,1045,320.0,2402,1905,0,PHL
177883,10,30,5,NK,216,12892,12266,1045,185.0,1379,1550,0,IAH

In [30]:
# Format the df_LAX2 file by replacing the DESINATION_AIRPORT column by the Code_y column.
column_to_move = df_LAX2.pop(df_LAX2.columns[-1])
df_LAX2.insert(7, "DESINATION_AIRPORT1", column_to_move)

df_LAX2 = df_LAX2.drop(['DESTINATION_AIRPORT'], axis=1)
df_LAX2 = df_LAX2.rename(columns={'DESINATION_AIRPORT1':'DESTINATION_AIRPORT'})
df_LAX2

,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,SCHEDULED_TIME,DISTANCE,SCHEDULED_ARRIVAL,CANCELLED
161169,10,1,4,AA,699,12892,RDU,1020,298.0,2239,1818,0
161170,10,1,4,DL,725,12892,TPA,1020,268.0,2158,1748,0
161171,10,1,4,OO,4794,12892,PHX,1020,91.0,370,1151,0
161172,10,1,4,DL,2218,12892,HNL,1025,340.0,2556,1305,0
161173,10,1,4,OO,4765,12892,OAK,1025,88.0,337,1153,0
...,...,...,...,...,...,...,...,...,...,...,...,...
177879,10,30,5,WN,1508,12892,LAS,1040,65.0,236,1145,0
177880,10,30,5,DL,1754,12892,ATL,1045,255.0,1947,1800,0
177881,10,30,5,AA,1297,12892,MIA,1045,301.0,2342,1846,0
177882,10,30,5,AA,796,12892,PHL,1045,320.0,2402,1905,0
177883,10,30,5,NK,216,12892,IAH,1045,185.0,1379,1550,0

In [31]:
df_LAX1

,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,SCHEDULED_TIME,DISTANCE,SCHEDULED_ARRIVAL,CANCELLED,Code_y
0,1,1,4,AA,2336,LAX,PBI,10,280.0,2330,750,0,NaN
1,1,1,4,AA,258,LAX,MIA,20,285.0,2342,805,0,NaN
2,1,1,4,US,2013,LAX,CLT,30,273.0,2125,803,0,NaN
3,1,1,4,DL,1434,LAX,MSP,35,214.0,1535,609,0,NaN
4,1,1,4,AA,115,LAX,MIA,105,286.0,2342,851,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
211383,12,31,4,AA,1538,LAX,MIA,2355,293.0,2342,748,0,NaN
211384,12,31,4,AS,175,LAX,ANC,2355,350.0,2345,445,0,NaN
211385,12,31,4,AS,471,LAX,SEA,2355,169.0,954,244,0,NaN
211386,12,31,4,AA,219,LAX,ORD,2359,244.0,1744,603,0,NaN
211387,12,31,4,B6,688,LAX,BOS,2359,320.0,2611,819,0,NaN

In [32]:
# Delete the last column in df_LAX1 file.
df_LAX1 = df_LAX1.drop(df_LAX1.columns[12], axis=1)
df_LAX1

,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,SCHEDULED_TIME,DISTANCE,SCHEDULED_ARRIVAL,CANCELLED
0,1,1,4,AA,2336,LAX,PBI,10,280.0,2330,750,0
1,1,1,4,AA,258,LAX,MIA,20,285.0,2342,805,0
2,1,1,4,US,2013,LAX,CLT,30,273.0,2125,803,0
3,1,1,4,DL,1434,LAX,MSP,35,214.0,1535,609,0
4,1,1,4,AA,115,LAX,MIA,105,286.0,2342,851,0
...,...,...,...,...,...,...,...,...,...,...,...,...
211383,12,31,4,AA,1538,LAX,MIA,2355,293.0,2342,748,0
211384,12,31,4,AS,175,LAX,ANC,2355,350.0,2345,445,0
211385,12,31,4,AS,471,LAX,SEA,2355,169.0,954,244,0
211386,12,31,4,AA,219,LAX,ORD,2359,244.0,1744,603,0
211387,12,31,4,B6,688,LAX,BOS,2359,320.0,2611,819,0

In [33]:
df_LAX = pd.concat([df_LAX1, df_LAX2], axis=0)
df_LAX

,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,SCHEDULED_TIME,DISTANCE,SCHEDULED_ARRIVAL,CANCELLED
0,1,1,4,AA,2336,LAX,PBI,10,280.0,2330,750,0
1,1,1,4,AA,258,LAX,MIA,20,285.0,2342,805,0
2,1,1,4,US,2013,LAX,CLT,30,273.0,2125,803,0
3,1,1,4,DL,1434,LAX,MSP,35,214.0,1535,609,0
4,1,1,4,AA,115,LAX,MIA,105,286.0,2342,851,0
...,...,...,...,...,...,...,...,...,...,...,...,...
177879,10,30,5,WN,1508,12892,LAS,1040,65.0,236,1145,0
177880,10,30,5,DL,1754,12892,ATL,1045,255.0,1947,1800,0
177881,10,30,5,AA,1297,12892,MIA,1045,301.0,2342,1846,0
177882,10,30,5,AA,796,12892,PHL,1045,320.0,2402,1905,0
177883,10,30,5,NK,216,12892,IAH,1045,185.0,1379,1550,0

In [34]:
df_LAX.isnull().sum()

MONTH                  0
DAY                    0
DAY_OF_WEEK            0
AIRLINE                0
FLIGHT_NUMBER          0
ORIGIN_AIRPORT         0
DESTINATION_AIRPORT    0
SCHEDULED_DEPARTURE    0
SCHEDULED_TIME         0
DISTANCE               0
SCHEDULED_ARRIVAL      0
CANCELLED              0
dtype: int64

In [35]:
df_LAX.sample(5)

,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,SCHEDULED_TIME,DISTANCE,SCHEDULED_ARRIVAL,CANCELLED
147025,9,6,7,AA,161,LAX,OGG,1725,352.0,2486,2017,0
60158,4,16,4,WN,980,LAX,DEN,1610,140.0,862,1930,0
67835,4,29,3,OO,6333,LAX,SAN,2041,53.0,109,2134,0
195017,12,2,3,WN,1794,LAX,MCI,845,190.0,1363,1355,0
40191,3,13,5,OO,2849,LAX,ELP,840,120.0,715,1140,0

In [36]:
# Verify if the ORIGIN_AIRPORT values are either LAX or 12892.  If so, we can deleted the
# ORIGIN_AIRPORT column.
df_LAX.ORIGIN_AIRPORT.unique()
df_LAX.drop('ORIGIN_AIRPORT', axis=1, inplace=True)

Next, we want to merge the 3 files for flights, airports and airlines together.  We want the main file to show all the flight information as is, along with the destination aiport cities & states from the airport file and the airline names from the airline file.

In [37]:
# Add 'DESTINATION_AIRPORT' and 'DESTINATION_STATE' to df by left joining df_LAX with df.

df_airport = df_airport.drop(['LATITUDE','LONGITUDE', 'COUNTRY','AIRPORT'], axis=1)
df_airport.rename(columns = {'IATA_CODE':'DESTINATION_AIRPORT'}, inplace = True)

df = pd.merge(df_LAX, df_airport, how = 'left', on = ['DESTINATION_AIRPORT'])
df.rename(columns = {'CITY':'DESTINATION_CITY', 'STATE':'DESTINATION_STATE'}, inplace = True)

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 211388 entries, 0 to 211387
Data columns (total 13 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   MONTH                211388 non-null  int64
 1   DAY                  211388 non-null  int64
 2   DAY_OF_WEEK          211388 non-null  int64
 3   AIRLINE              211388 non-null  object
 4   FLIGHT_NUMBER        211388 non-null  int64
 5   DESTINATION_AIRPORT  211388 non-null  object
 6   SCHEDULED_DEPARTURE  211388 non-null  int64
 7   SCHEDULED_TIME       211388 non-null  float64
 8   DISTANCE             211388 non-null  int64
 9   SCHEDULED_ARRIVAL    211388 non-null  int64
 10  CANCELLED            211388 non-null  int64
 11  DESTINATION_CITY     211388 non-null  object
 12  DESTINATION_STATE    211388 non-null  object
dtypes: float64(1), int64(8), object(4)
memory usage: 22.6+ MB

In [39]:
df.sample(5)

,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,SCHEDULED_TIME,DISTANCE,SCHEDULED_ARRIVAL,CANCELLED,DESTINATION_CITY,DESTINATION_STATE
33660,3,1,7,AA,1128,MIA,2345,284.0,2342,729,0,Miami,FL
81260,5,22,5,WN,3576,SJC,1815,65.0,308,1920,0,San Jose,CA
163760,11,5,4,AA,52,DCA,1320,295.0,2311,2115,0,Arlington,VA
130729,8,11,2,AS,569,PDX,635,140.0,834,855,0,Portland,OR
119434,7,24,5,VX,781,SEA,745,150.0,954,1015,0,Seattle,WA

In [40]:
# Add airline name to the df by left join.

df.rename(columns = {'AIRLINE':'IATA_CODE'}, inplace = True)
df = pd.merge(df, df_airline, how = 'left', on = ['IATA_CODE'])

After merging the 3 files together, let's take a look at the "comprehensive" file we have.

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 211388 entries, 0 to 211387
Data columns (total 14 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   MONTH                211388 non-null  int64
 1   DAY                  211388 non-null  int64
 2   DAY_OF_WEEK          211388 non-null  int64
 3   IATA_CODE            211388 non-null  object
 4   FLIGHT_NUMBER        211388 non-null  int64
 5   DESTINATION_AIRPORT  211388 non-null  object
 6   SCHEDULED_DEPARTURE  211388 non-null  int64
 7   SCHEDULED_TIME       211388 non-null  float64
 8   DISTANCE             211388 non-null  int64
 9   SCHEDULED_ARRIVAL    211388 non-null  int64
 10  CANCELLED            211388 non-null  int64
 11  DESTINATION_CITY     211388 non-null  object
 12  DESTINATION_STATE    211388 non-null  object
 13  AIRLINE              211388 non-null  object
dtypes: float64(1), int64(8), object(5)
memory usage: 24.2+ MB

In [42]:
# Now that we have the "AIRLINE" column, we no longer need the "IATA_CODE" column. 

df = df.drop(['IATA_CODE'], axis=1)
df.head(5)

,MONTH,DAY,DAY_OF_WEEK,FLIGHT_NUMBER,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,SCHEDULED_TIME,DISTANCE,SCHEDULED_ARRIVAL,CANCELLED,DESTINATION_CITY,DESTINATION_STATE,AIRLINE
0,1,1,4,2336,PBI,10,280.0,2330,750,0,West Palm Beach,FL,American Airlines Inc.
1,1,1,4,258,MIA,20,285.0,2342,805,0,Miami,FL,American Airlines Inc.
2,1,1,4,2013,CLT,30,273.0,2125,803,0,Charlotte,NC,US Airways Inc.
3,1,1,4,1434,MSP,35,214.0,1535,609,0,Minneapolis,MN,Delta Air Lines Inc.
4,1,1,4,115,MIA,105,286.0,2342,851,0,Miami,FL,American Airlines Inc.

In [43]:
df.shape

(211388, 13)

Before we move on to the Data Exploratory Analysis phase of this project, let's save the
cleaned and sorted database to the local drive, so that it can be imported again in the
next phase of our project in a separate jupyter notebook.

In [44]:
df.to_csv("flight_lax.csv")